Repository: Mupen64-Rewrite/M64RPFW
Catalog: M64RPFW.Views.Avalonia/Resources/Resources.*.resx
Languages: de_de

source: File
de_de: Datei

source: Author
de_de: Autor

source: Browse...
de_de: Durchsuchen...

source: Cancel
de_de: Abbrechen

source: Close Rom
de_de: Rom schließen

source: Core
de_de: Kern

source: Current Slot
de_de: Ausgewählter Slot

source: Description
de_de: Beschreibung

source: Disable Expansion Pak Memory
de_de: Expansion Pak-Speicher deaktivieren

# DisableWrites
source: Read-only
de_de: Schreibschutz

source: Frame Advance
de_de: Bild fortschreiten

source: Input
de_de: Eingabe

source: Load Current Slot
de_de: Ausgewählten Slot laden

source: Load from File...
de_de: Von Datei laden...

source: Load State
de_de: State laden

source: Movie
de_de: Aufnahme

source: Open Rom...
de_de: Rom öffnen...

# PauseOrResume
source: Pause/Resume
de_de: Pausieren/Fortsetzen

source: Randomize interrupt timings
de_de: Interrupt-Timings randomisieren

source: Reset Rom
de_de: Rom neu laden

source: Restart Movie
de_de: Aufnahme neu starten

source: Save Current Slot
de_de: Ausgewählten Slot speichern

source: Save State
de_de: State speichern

source: Save to File...
de_de: Speichern unter...

source: Settings
de_de: Einstellungen

source: Start from
de_de: Startzustand

source: Start Encoder...
de_de: Encoder starten...

source: Start Playing...
de_de: Wiedergabe starten...

source: Start Recording...
de_de: Aufnahme starten...

source: Stop Encoder
de_de: Encoder stoppen

source: Stop Movie
de_de: Aufnahme stoppen...

# ToggleDisableWrites
source: Toggle Read-only
de_de: Schreibschutz umschalten

# Culture
source: Language
de_de: Sprache

source: Theme
de_de: Farbschema

source: Recent Roms
de_de: Aktuelle Roms
